app/controllers/matches_controller.rb

  def create
    day = params[:match][:day]
    matches_for_day = Match.select {|match| match.day == day.to_date}
---
SELECT "matches".* FROM "matches"

  def show
    @match = Match.find(params[:id])
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]